Repository: Mireiawen/ff14
Catalog: fw/translations/*/LC_MESSAGES/RoseFramework.po
Languages: fi_fi

source: PHP version must be at least %s
fi_fi: PHP versio on oltava vähintään %s

source: %s "%s" was not found or was not directory
fi_fi: %s polku "%s" ei löytynyt tai ei ole hakemisto

source: File "%s" does not exist or is not readable
fi_fi: Tiedostoa "%s" ei ole olemassa tai sitä ei voida lukea

source: %s "%s" was not found, was not directory or is not writable
fi_fi: %s polku "%s" ei löytynyt, ei ole hakemisto tai ei ole kirjoitettavissa

source: Rose Framework - No title set
fi_fi: Rose Framework - ei otsikko asetettu

source: Error during initialization:
fi_fi: Virhe alustuksen aikana:

source: MySQLi extension is required!
fi_fi: MySQLi laajennus vaaditaan!

source: Invalid environment detected
fi_fi: Virheellinen ympäristö havaittu

source: DEBUG warning: Missing Smarty Object
fi_fi: DEBUG Varoitus: Smartyn objekti puuttuu

source: DEBUG warning: Missing template file "%s"
fi_fi: DEBUG varoitus: mallitiedosto "%s" puuttuu

source: GeoIP is not available
fi_fi: GeoIP ei ole käytettävissä

source: Unable to open GeoIP database
fi_fi: GeoIP -tietokannan avaaminen epäonnistui

source: Missing key "%s" in %s
fi_fi: Avain "%s" puuttuu sijainnista %s

source: %s method call is missing the variable name
fi_fi: %s menetelmän kutsusta puuttuu muuttujan nimi

source: Invalid call to unknown method "%s"
fi_fi: Virheellinen kutsu tuntemattomaan menetelmään "%s"

source: Invalid amount of arguments for method "%s"
fi_fi: Virheellinen määrä parametrejä kutsulle "%s"

source: Changing of ID is not allowed
fi_fi: Tunnisteen muuttaminen ei ole sallittua

source: Unable to create User object
fi_fi: Käyttäjäobjektia ei voitu luoda

source: Invalid username or password
fi_fi: Virheellinen käyttäjätunnus tai salasana

source: Invalid username or password: %s
fi_fi: Virheellinen käyttäjänimi tai salasana: %s

source: Invalid argument "%s": %s
fi_fi: Virheellinen argumentti "%s": %s

source: It is not a file
fi_fi: Se ei ole tiedosto

source: Unknown error
fi_fi: Tuntematon virhe

source: Unable to open the file "%s": %s
fi_fi: Tiedostoa "%s" ei voi avata: %s

source: Unable to connect to the database: %s
fi_fi: Yhteyden muodostaminen tietokantaan ei onnistunut: %s

source: "%s" is not a valid object creation key: %s
fi_fi: "%s" ei ole kelvollinen objektin luomisen avain: %s

source: It does not exist
fi_fi: Sellaista ei ole

source: It is not unique
fi_fi: Se ei ole ainutlaatuinen

source: Unable to execute database query: %s
fi_fi: Tietokannan kyselyä ei voi suorittaa: %s

source: Unable to find %s with %s of value %s
fi_fi: Luokkaa %s avaimen %s arvolla %s ei löydy

source: Unable to create %s from array: missing key %s
fi_fi: Kohteen %s luominen taulukosta epäonnistui: puuttuu avain %s

source: No database
fi_fi: Ei tietokantaa

source: Unknown key "%s" in "%s"
fi_fi: Tuntematon avain "%s" kohteessa "%s"

source: Unknown data type "%s"
fi_fi: Tuntematon tietolaji "%s"

source: reCAPTCHA verification was incorrect: %s
fi_fi: reCAPTCHA tarkastus oli virheellinen: %s

source: The uploaded file exceeds the upload_max_filesize directive in php.ini
fi_fi: Lähetetty tiedosto ylittää php.ini -tiedostossa määritetyn upload_max_filesize -arvon

source: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the HTML form
fi_fi: Lähetetty tiedosto ylittää HTML-lomakkeella määritetyn MAX_FILE_SIZE -arvon

source: The uploaded file was only partially uploaded
fi_fi: Tiedosto lähetettiin vain osittain

source: No file was uploaded
fi_fi: Tiedostoa ei lähetetty

source: Missing a temporary folder
fi_fi: Väliaikainen kansio puuttuu

source: Failed to write file to disk
fi_fi: Tiedostoon kirjoittaminen epäonnistui

source: A PHP extension stopped the file upload
fi_fi: PHP -laajennos on estänyt tiedoston lähettämisen

source: Unknown upload error code %d
fi_fi: Tunnistamaton lähetyksen virhekoodi %d

source: ImageMagick or GD extension is required!
fi_fi: ImageMagick tai GD laajennus vaaditaan!

source: File "%s" was not found or was not readable
fi_fi: Tiedosto "%s" ei löytynyt tai ei voitu lukea

source: Unable to read image size from "%s": %s
fi_fi: Kuvakoon lukeminen kohteesta "%s" epäonnistui: %s

source: Unknown size
fi_fi: Tuntematon koko

source: Expected 2 integers, got %s and %s
fi_fi: Odotettiin 2 kokonaislukua, saatiin %s ja %s

source: Invalid size for the image: %dx%d
fi_fi: Kelvoton koko kuvalle: %dx%d

source: Unable to create the resized image: %s
fi_fi: Muutetun kuvakoon kuvan luominen epäonnistui: %s

source: GD failed, see server error log
fi_fi: GD epäonnistui, katso palvelimen loki

source: Unable to scale the image
fi_fi: Kuvan skaalaus ei onnistunut

source: Invalid scale for the image: %f
fi_fi: Virheellinen skaala kuvalle: %f

source: Support for file type %s is missing
fi_fi: Tuki tiedostotyypille %s puuttuu

source: Invalid image type "%s"
fi_fi: Virheellinen kuvan tyyppi "%s"

source: Invalid image file "%s" for MIME type "%s"
fi_fi: Virheellinen kuvatiedosto "%s" MIME-tyypille "%s"

source: Unable to connect to database: %s
fi_fi: Yhteyden muodostaminen tietokantaan ei onnistunut: %s

source: Unable to set character set: %s
fi_fi: Merkistön määrittäminen epäonnistui: %s

source: File information extension fileinfo is required!
fi_fi: Tiedostoinformaation laajennus fileinfo vaaditaan!

source: Unable to read the given file "%s"
fi_fi: Tiedoston "%s" lukeminen ei onnistu

source: Invalid AJAX call %s
fi_fi: Virheellinen AJAX-kutsu %s

source: Access to "%s" is denied for %s
fi_fi: Pääsy kohteeseen "%s" on estetty käyttäjältä %s

source: Access denied
fi_fi: Pääsy estetty

source: Page "%s" not found
fi_fi: Sivu "%s" ei löytynyt

source: Page not found
fi_fi: Sivua ei löytynyt

source: Page "%s" does not exist or is not readable
fi_fi: Sive "%s" ei ole olemassa tai luettavissa

source: Page does not implement required class "%s"
fi_fi: Sivu ei toteuta vaadittua luokkaa "%s"

source: Class "%s" does not implement required interface "%s"
fi_fi: Luokka "%s" ei toteuta vaadittua rajapintaa "%s"

source: Unable to read JSON data
fi_fi: JSON datan lukeminen epäonnistui

source: Session is empty
fi_fi: Istunto on tyhjä

source: Session variables mismatch
fi_fi: Istunnon muuttujat eivät täsmää

source: Session remote address mismatch
fi_fi: Istunnon etäosoite ei täsmää

source: Session user agent mismatch
fi_fi: Istunnon käyttäjäagentti ei täsmää

source: Session timed out
fi_fi: Istunnon aikakatkaisu

source: Session DEBUG warning: %s
fi_fi: Istunnon DEBUG varoitus: %s

source: Invalid event ID
fi_fi: Virheellinen tapahtumatunnus

source: No such event "%s"
fi_fi: Tapahtumaa "%s" ei löydy

source: Invalid log entry; it is empty!
fi_fi: Virheellinen tapahtuma; on tyhjä!

source: Unknown
fi_fi: Tuntematon

source: Unknown error level %s
fi_fi: Tuntematon virhetaso %s

source: No such message type "%s"
fi_fi: Viestityyppiä "%s" ei ole olemassa

source: Instance of %s does not exist yet
fi_fi: Instanssia luokasta %s ei vielä ole

source: Internationalization extension intl is required!
fi_fi: Kansainvälistyminen laajennus intl tarvitaan!

source: File sizes differ; expected %d, got %d bytes
fi_fi: Tiedostojen koko eroaa; odotettiin %d, mutta saatiin %d tavua

source: File type differ; expected "%s", got "%s"
fi_fi: Tiedostotyypit eroavat; odotettiin "%s" mutta saatiin "%s"

source: File "%s" is not a valid upload file or no longer exists
fi_fi: Tiedosto "%s" ei ole kelvollinen lähetetty tiedosto tai se ei enää ole olemassa

source: The destination file already exists
fi_fi: Kohdetiedosto on jo olemassa

source: Moving of uploaded file "%s" to its destination "%s" failed: %s"
fi_fi: Lähetetyn tiedoston "%s" siirto kohteeseen "%s" epäonnistui: %s

source: Hash extension is required!
fi_fi: Hash laajennus vaaditaan!

source: unknown
fi_fi: tuntematon

source: Username "%s" is already taken
fi_fi: Käyttäjätunnus "%s" on jo olemassa

source: Invalid e-mail address "%s"
fi_fi: Virheellinen sähköpostiosoite "%s"

source: Email "%s" is already in use
fi_fi: Sähköposti "%s" on jo käytössä

source: Invalid user ID
fi_fi: Virheellinen käyttäjän tunniste

source: DEBUG Invalid input; expecting array, got %s
fi_fi: DEBUG Virheellinen syöte; odotettiin taulukkoa, saatiin %s

source: Invalid access level given
fi_fi: Virheellinen käyttöoikeuden taso annettu

source: Invalid user %s
fi_fi: Virheellinen käyttäjä %s

source: Creation of strong password salt failed
fi_fi: Vahvan salasanan suolan luominen epäonnistui

source: No secure random found, falling back to cryptographically unsafe methods. You should enable OpenSSL or MCrypt extension
fi_fi: Turvallista satunnaismenetelmää ei löytynyt, turvaudutaan kryptograafisesti heikkoihin menetelmiin. Sinun tulisi ottaa käyttöön OpenSSL tai MCrypt laajennus

source: Invalid hashing algorithm "%s": %s
fi_fi: Virheellinen hajautusalgoritmi "%s": %s

source: It was not found
fi_fi: Ei löytynyt

source: Invalid hashing parameters
fi_fi: Virheelliset hajautuksen parametrit

source: Caught invalid password hash
fi_fi: Virheellinen salasanan tiiviste

source: The key "%s" was not found in the cache
fi_fi: Avain "%s" ei löydy välimuistista

source: Dashboard for %s
fi_fi: Hallintapaneeli käyttäjälle %s

source: Invalid email address %s
fi_fi: Virheellinen sähköpostiosoite %s

source: Email updated succesfully
fi_fi: Sähköpostiosoite päivitettiin onnistuneesti

source: Name updated succesfully
fi_fi: Nimi päivitettiin onnistuneesti

source: Old password does not match
fi_fi: Vanha salasana ei täsmää

source: Passwords do not match
fi_fi: Salasanat eivät täsmää

source: Passwords is not changed
fi_fi: Salasana ei ole muuttunut

source: Password is too short
fi_fi: Salasana on liian lyhyt

source: Password cannot be your username
fi_fi: Salasana ei voi olla käyttäjätunnuksesi

source: Password cannot be your name
fi_fi: Salasana ei voi olla nimesi

source: Password is too simple
fi_fi: Salasana on liian yksinkertainen

source: Password updated succesfully
fi_fi: Salasana päivitettiin onnistuneesti

source: Login
fi_fi: Kirjaudu

source: Error - %s
fi_fi: Virhe - %s

source: Got error %d. Additionally, was unable to load any error template!
fi_fi: Saatiin virhe %d. Lisäksi kaikkien virhemallinteiden lataaminen epäonnistui!

source: Rose Framework - Default Page
fi_fi: Rose Framework - Oletussivu

source: Hello %1!
fi_fi: Hei ¤1!

source: If you are seeing this, it means you have successfully installed Rose Framework.
fi_fi: Jos näet tämän, se tarkoittaa, olet onnistuneesti asentanut Rose Frameworkin.

source: Go on, try making something out from it!
fi_fi: Anna mennä, kokeile luoda jotakin sillä!

source: Rose Framework Development Team
fi_fi: Rose Framework kehitystiimi

source: Username:
fi_fi: Käyttäjänimi:

source: Name:
fi_fi: Nimi:

source: Email:
fi_fi: Sähköposti:

source: Password:
fi_fi: Salasana:

source: Register
fi_fi: Rekisteröi

source: User ID:
fi_fi: Käyttäjä-ID:

source: Current password:
fi_fi: Nykyinen salasana:

source: New password:
fi_fi: Uusi salasana:

source: Update
fi_fi: Päivitä

source: I'm a teapot. Want some tea?
fi_fi: Olen teekannu. Haluatko teetä?

source: Payment required. Try paying your account.
fi_fi: Maksu vaaditaan. Yritä maksaa tilisi.

source: The server understood the request, but is refusing to fulfill it. Authorization will not help and the request should not be repeated.
fi_fi: Palvelin ymmärsi pyynnön, mutta ei suostu suorittamaan sitä. Kirjautuminen ei auta, ja pyyntöä ei tulisi toistaa.

source: Error
fi_fi: Virhe

source: The server is currently unable to handle the request due to a temporary overloading or maintenance of the server.
fi_fi: Palvelin ei voi käsitellä pyyntöä tilapäisen kuormituksen tai palvelimen ylläpidon vuoksi.

source: This is an error page. Please see <a href="%1">more interesting things</a>.
fi_fi: Tämä on virhesivu. Ole hyvä ja katsele <a href="%1">mielenkiintosempia asioita</a>.

source: An error happened.
fi_fi: Tapahtui virhe.

source: The server has not found anything matching the Request-URI.
fi_fi: Palvelin ei löytänyt mitään joka täsmäisi pyydettyyn osoitteeseen.

source: The request requires user authentication. Try logging it with correct permissions.
fi_fi: Pyyntö vaatii käyttäjän todennuksen. Yritä kirjautua oikeailla käyttöoikeuksilla.

source: Error!
fi_fi: Virhe!
